{
  "backend/main.mo": "Main Motoko actor for a travel booking platform, defining data types and state for destinations, travel packages, flights, bookings, blog posts, testimonials, user profiles, and contact submissions, with authorization and blob storage mixins included.",
  "backend/migration.mo": "Migration module that defines the OldActor type mirroring all backend state shapes and exports a no-op `run` function for schema migration on upgrade.",
  "feature_evidence.json": "Feature evidence report mapping the homepage restoration feature (version 28 layout) to its relevant frontend files, components, and test IDs with high confidence.",
  "frontend-file-summaries.txt": "Text file containing short summaries of each frontend source file, describing the purpose and key contents of components, pages, hooks, and utilities in the React frontend.",
  "frontend/index.css": "Base Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark theme color tokens including background, foreground, primary, chart, and sidebar variables.",
  "frontend/index.html": "HTML entry point for the React app, setting the page title to 'Tour & Travel Air Ticket Booking Website' and mounting the app at the `#root` div.",
  "frontend/src/App.tsx": "Root React component managing page routing via a `Page` union type, authentication state via Internet Identity, admin status, and rendering TopBar, Header, Footer, WhatsApp button, and page-specific components.",
  "frontend/src/components/FlightSearchResults.tsx": "Component that displays flight search results as cards with booking dialogs, handles authenticated booking creation via React Query mutation, and shows an empty state when no flights are found.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with brand info, social media links (Facebook, Instagram, WhatsApp), quick navigation links, and popular destinations list.",
  "frontend/src/components/Header.tsx": "Sticky top navigation header with logo, desktop/mobile nav links, Internet Identity auth controls, and an admin dashboard link for admin users.",
  "frontend/src/components/MessageSection.tsx": "A travel enquiry form section that collects name, destination, travel date, and number of persons, then opens a pre-filled WhatsApp chat link on submission.",
  "frontend/src/components/PackageDetailsDialog.tsx": "A modal dialog that displays full details of a travel package including its image, description, and price, triggered by a child element or default button.",
  "frontend/src/components/ProfileSetupModal.tsx": "A blocking modal dialog that prompts newly authenticated users to enter their name, email, and phone number to create their profile via the backend mutation.",
  "frontend/src/components/TopBar.tsx": "A slim top announcement bar displaying the brand tagline and a WhatsApp enquiry link with phone icon.",
  "frontend/src/components/WhatsAppButton.tsx": "A fixed floating WhatsApp contact button in the bottom-right corner that links to a pre-built WhatsApp enquiry URL.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an authenticated or anonymous ICP backend actor using the current Internet Identity, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP platform, managing login/logout state, identity persistence, and AuthClient creation with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks (queries and mutations) for all backend actor interactions including user profiles, destinations, travel packages, flights, bookings, contacts, blog posts, testimonials, and more.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, configures Tailwind CSS, and defines CSS custom properties for a purple-blue travel-themed design system with light and dark mode support.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider into the DOM root.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin-only dashboard page with tabbed forms for adding destinations, travel packages, and flights, plus a view of contact submissions, guarded by an admin role check.",
  "frontend/src/pages/BookingsPage.tsx": "Displays the authenticated user's flight bookings with status badges and formatted dates, showing login prompts or empty states when appropriate.",
  "frontend/src/pages/ContactPage.tsx": "Contact page with a form collecting name, destination, travel date, and number of persons, which on submission opens a pre-filled WhatsApp enquiry link.",
  "frontend/src/pages/EnquiryPage.tsx": "A travel enquiry form page that collects name, destination, travel date, and number of persons, then opens a pre-filled WhatsApp message via a generated link.",
  "frontend/src/pages/HomePage.tsx": "The main homepage composed of multiple sections (hero, promo banner, flight search, destinations, packages, blog, testimonials) using React Query hooks and WhatsApp link utilities.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/src/utils/whatsappLinkBuilder.ts": "Exports two functions that build WhatsApp wa.me deep-link URLs pre-filled with enquiry or flight-search message data for a fixed phone number.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom colors (CSS variables), fonts, border radii, shadows, spacing, animations, and enabling the animate, typography, and container-queries plugins.",
  "project_state.json": "Project state metadata for Joyguru Travels tracking schema version, existing features, and a pending action request to restore backend data records from version 28."
}