{
  "backend/main.mo": "Defines the core canister with storage, authorization, and data models for destinations, packages, flights, bookings, user profiles, contacts, blog posts, and testimonials.",
  "backend/migration.mo": "Contains a no-op migration function that returns the previous state unchanged.",
  "feature_evidence.json": "Lists feature evidence metadata mapping features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Provides short prewritten summaries for various frontend source files, mainly UI components and pages.",
  "frontend/index.css": "Defines Tailwind base layers and OKLCH-themed CSS variables for light and dark modes.",
  "frontend/index.html": "Basic HTML entry point mounting the root element and loading the main React script.",
  "frontend/src/App.tsx": "Main React app component handling routing, authentication state, theming, and global UI elements.",
  "frontend/src/components/FlightSearchResults.tsx": "Displays flight search results with booking dialogs, authentication checks, and formatted flight details.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with contact information and a credits section.",
  "frontend/src/components/Header.tsx": "Navigation header with authentication handling, mobile menu, and conditional admin/user links.",
  "frontend/src/components/PackageDetailsDialog.tsx": "Dialog showing detailed travel package info including image, price, and description.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting users to enter and save their profile details via a form submission.",
  "frontend/src/components/TopBar.tsx": "Top banner displaying marketing text and a WhatsApp contact link.",
  "frontend/src/components/WhatsAppButton.tsx": "Floating WhatsApp button linking to an enquiry chat.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the backend actor, updating queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity context provider and hook managing login state and identity loading.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for user profiles, destinations, packages, admin checks, and other backend interactions.",
  "frontend/src/index.css": "Tailwind CSS setup with theme variables, dark mode values, and base typography styles.",
  "frontend/src/main.tsx": "Initializes React root and wraps the app with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin interface for managing destinations, packages, flights, and viewing contacts with form handling and backend mutations.",
  "frontend/src/pages/BookingsPage.tsx": "Displays authenticated users' flight bookings with status formatting and loading states.",
  "frontend/src/pages/ContactPage.tsx": "Contact form that validates user input and opens a WhatsApp enquiry link.",
  "frontend/src/pages/EnquiryPage.tsx": "Simple enquiry form that builds and opens a WhatsApp message after validating inputs.",
  "frontend/src/pages/HomePage.tsx": "Home landing page showing destinations, packages, and blogs, and includes flight search with results handling.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters, persist them in sessionStorage, and clear them from the hash.",
  "frontend/src/utils/whatsappLinkBuilder.ts": "Builds a WhatsApp wa.me link with a pre-filled enquiry message using optional user data.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, spacing, shadows, keyframes, and enabling plugins.",
  "project_state.json": "Metadata describing the project’s state, features, issues, and requirements for WhatsApp enquiry flow updates."
}